leeseunghun057/STM32with8000Hz/STM32H743/Core/Inc/main.h
    QK_USER_20 = 0x7E54,
    QK_USER_21 = 0x7E55,
    QK_USER_22 = 0x7E56,
    QK_USER_23 = 0x7E57,
    QK_USER_24 = 0x7E58,
    QK_USER_25 = 0x7E59,
    QK_USER_26 = 0x7E5A,
    QK_USER_27 = 0x7E5B,
    QK_USER_28 = 0x7E5C,
    QK_USER_29 = 0x7E5D,
    QK_USER_30 = 0x7E5E,
    QK_USER_31 = 0x7E5F,

// Alias
    XXXXXXX    = KC_NO,
    _______    = KC_TRANSPARENT,
    KC_TRNS    = KC_TRANSPARENT,
    KC_ENT     = KC_ENTER,
    KC_ESC     = KC_ESCAPE,
    KC_BSPC    = KC_BACKSPACE,
    KC_SPC     = KC_SPACE,
    KC_MINS    = KC_MINUS,
    KC_EQL     = KC_EQUAL,
    KC_LBRC    = KC_LEFT_BRACKET,
    KC_RBRC    = KC_RIGHT_BRACKET,
    KC_BSLS    = KC_BACKSLASH,
    KC_NUHS    = KC_NONUS_HASH,
    KC_SCLN    = KC_SEMICOLON,
    KC_QUOT    = KC_QUOTE,
    KC_GRV     = KC_GRAVE,
    KC_COMM    = KC_COMMA,
    KC_SLSH    = KC_SLASH,
    KC_CAPS    = KC_CAPS_LOCK,
    KC_PSCR    = KC_PRINT_SCREEN,
    KC_SCRL    = KC_SCROLL_LOCK,
    KC_BRMD    = KC_SCROLL_LOCK,
    KC_PAUS    = KC_PAUSE,
    KC_BRK     = KC_PAUSE,
    KC_BRMU    = KC_PAUSE,
    KC_INS     = KC_INSERT,
    KC_PGUP    = KC_PAGE_UP,
    KC_DEL     = KC_DELETE,
    KC_PGDN    = KC_PAGE_DOWN,
    KC_RGHT    = KC_RIGHT,
    KC_NUM     = KC_NUM_LOCK,
    KC_PSLS    = KC_KP_SLASH,
    KC_PAST    = KC_KP_ASTERISK,
    KC_PMNS    = KC_KP_MINUS,
    KC_PPLS    = KC_KP_PLUS,
    KC_PENT    = KC_KP_ENTER,
    KC_P1      = KC_KP_1,
    KC_P2      = KC_KP_2,
    KC_P3      = KC_KP_3,
    KC_P4      = KC_KP_4,
    KC_P5      = KC_KP_5,
    KC_P6      = KC_KP_6,
    KC_P7      = KC_KP_7,
    KC_P8      = KC_KP_8,
    KC_P9      = KC_KP_9,
    KC_P0      = KC_KP_0,
    KC_PDOT    = KC_KP_DOT,
    KC_NUBS    = KC_NONUS_BACKSLASH,
    KC_APP     = KC_APPLICATION,
    KC_PEQL    = KC_KP_EQUAL,
    KC_EXEC    = KC_EXECUTE,
    KC_SLCT    = KC_SELECT,
    KC_AGIN    = KC_AGAIN,
    KC_PSTE    = KC_PASTE,
    KC_LCAP    = KC_LOCKING_CAPS_LOCK,
    KC_LNUM    = KC_LOCKING_NUM_LOCK,
    KC_LSCR    = KC_LOCKING_SCROLL_LOCK,
    KC_PCMM    = KC_KP_COMMA,
    KC_INT1    = KC_INTERNATIONAL_1,
    KC_INT2    = KC_INTERNATIONAL_2,
    KC_INT3    = KC_INTERNATIONAL_3,
    KC_INT4    = KC_INTERNATIONAL_4,
    KC_INT5    = KC_INTERNATIONAL_5,
    KC_INT6    = KC_INTERNATIONAL_6,
    KC_INT7    = KC_INTERNATIONAL_7,
    KC_INT8    = KC_INTERNATIONAL_8,
    KC_INT9    = KC_INTERNATIONAL_9,
    KC_LNG1    = KC_LANGUAGE_1,
    KC_LNG2    = KC_LANGUAGE_2,
    KC_LNG3    = KC_LANGUAGE_3,
    KC_LNG4    = KC_LANGUAGE_4,
    KC_LNG5    = KC_LANGUAGE_5,
    KC_LNG6    = KC_LANGUAGE_6,
    KC_LNG7    = KC_LANGUAGE_7,
    KC_LNG8    = KC_LANGUAGE_8,
    KC_LNG9    = KC_LANGUAGE_9,
    KC_ERAS    = KC_ALTERNATE_ERASE,
    KC_SYRQ    = KC_SYSTEM_REQUEST,
    KC_CNCL    = KC_CANCEL,
    KC_CLR     = KC_CLEAR,
    KC_PRIR    = KC_PRIOR,
    KC_RETN    = KC_RETURN,
    KC_SEPR    = KC_SEPARATOR,
    KC_CLAG    = KC_CLEAR_AGAIN,
    KC_CRSL    = KC_CRSEL,
    KC_EXSL    = KC_EXSEL,
    KC_PWR     = KC_SYSTEM_POWER,
    KC_SLEP    = KC_SYSTEM_SLEEP,
    KC_WAKE    = KC_SYSTEM_WAKE,
    KC_MUTE    = KC_AUDIO_MUTE,
    KC_VOLU    = KC_AUDIO_VOL_UP,
    KC_VOLD    = KC_AUDIO_VOL_DOWN,
    KC_MNXT    = KC_MEDIA_NEXT_TRACK,
    KC_MPRV    = KC_MEDIA_PREV_TRACK,
    KC_MSTP    = KC_MEDIA_STOP,
    KC_MPLY    = KC_MEDIA_PLAY_PAUSE,
    KC_MSEL    = KC_MEDIA_SELECT,
    KC_EJCT    = KC_MEDIA_EJECT,
    KC_CALC    = KC_CALCULATOR,
    KC_MYCM    = KC_MY_COMPUTER,
    KC_WSCH    = KC_WWW_SEARCH,
    KC_WHOM    = KC_WWW_HOME,
    KC_WBAK    = KC_WWW_BACK,
    KC_WFWD    = KC_WWW_FORWARD,
    KC_WSTP    = KC_WWW_STOP,
    KC_WREF    = KC_WWW_REFRESH,
    KC_WFAV    = KC_WWW_FAVORITES,
    KC_MFFD    = KC_MEDIA_FAST_FORWARD,
    KC_MRWD    = KC_MEDIA_REWIND,
    KC_BRIU    = KC_BRIGHTNESS_UP,
    KC_BRID    = KC_BRIGHTNESS_DOWN,
    KC_CPNL    = KC_CONTROL_PANEL,
    KC_ASST    = KC_ASSISTANT,
    KC_MCTL    = KC_MISSION_CONTROL,
    KC_LPAD    = KC_LAUNCHPAD,
    MS_UP      = QK_MOUSE_CURSOR_UP,
    MS_DOWN    = QK_MOUSE_CURSOR_DOWN,
    MS_LEFT    = QK_MOUSE_CURSOR_LEFT,
    MS_RGHT    = QK_MOUSE_CURSOR_RIGHT,
    MS_BTN1    = QK_MOUSE_BUTTON_1,
    MS_BTN2    = QK_MOUSE_BUTTON_2,
    MS_BTN3    = QK_MOUSE_BUTTON_3,
    MS_BTN4    = QK_MOUSE_BUTTON_4,
    MS_BTN5    = QK_MOUSE_BUTTON_5,
    MS_BTN6    = QK_MOUSE_BUTTON_6,
    MS_BTN7    = QK_MOUSE_BUTTON_7,
    MS_BTN8    = QK_MOUSE_BUTTON_8,
    MS_WHLU    = QK_MOUSE_WHEEL_UP,
    MS_WHLD    = QK_MOUSE_WHEEL_DOWN,
    MS_WHLL    = QK_MOUSE_WHEEL_LEFT,
    MS_WHLR    = QK_MOUSE_WHEEL_RIGHT,
    MS_ACL0    = QK_MOUSE_ACCELERATION_0,
    MS_ACL1    = QK_MOUSE_ACCELERATION_1,
    MS_ACL2    = QK_MOUSE_ACCELERATION_2,
    KC_LCTL    = KC_LEFT_CTRL,
    KC_LSFT    = KC_LEFT_SHIFT,
    KC_LALT    = KC_LEFT_ALT,
    KC_LOPT    = KC_LEFT_ALT,
    KC_LGUI    = KC_LEFT_GUI,
    KC_LCMD    = KC_LEFT_GUI,
    KC_LWIN    = KC_LEFT_GUI,
    KC_RCTL    = KC_RIGHT_CTRL,
    KC_RSFT    = KC_RIGHT_SHIFT,
    KC_RALT    = KC_RIGHT_ALT,
    KC_ROPT    = KC_RIGHT_ALT,
    KC_ALGR    = KC_RIGHT_ALT,
    KC_RGUI    = KC_RIGHT_GUI,
    KC_RCMD    = KC_RIGHT_GUI,
    KC_RWIN    = KC_RIGHT_GUI,
    SH_TOGG    = QK_SWAP_HANDS_TOGGLE,
    SH_TT      = QK_SWAP_HANDS_TAP_TOGGLE,
    SH_MON     = QK_SWAP_HANDS_MOMENTARY_ON,
    SH_MOFF    = QK_SWAP_HANDS_MOMENTARY_OFF,
    SH_OFF     = QK_SWAP_HANDS_OFF,
    SH_ON      = QK_SWAP_HANDS_ON,
    SH_OS      = QK_SWAP_HANDS_ONE_SHOT,
    CL_SWAP    = QK_MAGIC_SWAP_CONTROL_CAPS_LOCK,
    CL_NORM    = QK_MAGIC_UNSWAP_CONTROL_CAPS_LOCK,
    CL_TOGG    = QK_MAGIC_TOGGLE_CONTROL_CAPS_LOCK,
    CL_CAPS    = QK_MAGIC_CAPS_LOCK_AS_CONTROL_OFF,
    CL_CTRL    = QK_MAGIC_CAPS_LOCK_AS_CONTROL_ON,
    AG_LSWP    = QK_MAGIC_SWAP_LALT_LGUI,
    AG_LNRM    = QK_MAGIC_UNSWAP_LALT_LGUI,
    AG_RSWP    = QK_MAGIC_SWAP_RALT_RGUI,
    AG_RNRM    = QK_MAGIC_UNSWAP_RALT_RGUI,
    GU_ON      = QK_MAGIC_GUI_ON,
    GU_OFF     = QK_MAGIC_GUI_OFF,
    GU_TOGG    = QK_MAGIC_TOGGLE_GUI,
    GE_SWAP    = QK_MAGIC_SWAP_GRAVE_ESC,
    GE_NORM    = QK_MAGIC_UNSWAP_GRAVE_ESC,
    BS_SWAP    = QK_MAGIC_SWAP_BACKSLASH_BACKSPACE,
    BS_NORM    = QK_MAGIC_UNSWAP_BACKSLASH_BACKSPACE,
    BS_TOGG    = QK_MAGIC_TOGGLE_BACKSLASH_BACKSPACE,
    NK_ON      = QK_MAGIC_NKRO_ON,
    NK_OFF     = QK_MAGIC_NKRO_OFF,
    NK_TOGG    = QK_MAGIC_TOGGLE_NKRO,
    AG_SWAP    = QK_MAGIC_SWAP_ALT_GUI,
    AG_NORM    = QK_MAGIC_UNSWAP_ALT_GUI,
    AG_TOGG    = QK_MAGIC_TOGGLE_ALT_GUI,
    CG_LSWP    = QK_MAGIC_SWAP_LCTL_LGUI,
    CG_LNRM    = QK_MAGIC_UNSWAP_LCTL_LGUI,
    CG_RSWP    = QK_MAGIC_SWAP_RCTL_RGUI,
    CG_RNRM    = QK_MAGIC_UNSWAP_RCTL_RGUI,
    CG_SWAP    = QK_MAGIC_SWAP_CTL_GUI,
    CG_NORM    = QK_MAGIC_UNSWAP_CTL_GUI,
    CG_TOGG    = QK_MAGIC_TOGGLE_CTL_GUI,
    EH_LEFT    = QK_MAGIC_EE_HANDS_LEFT,
    EH_RGHT    = QK_MAGIC_EE_HANDS_RIGHT,
    EC_SWAP    = QK_MAGIC_SWAP_ESCAPE_CAPS_LOCK,
    EC_NORM    = QK_MAGIC_UNSWAP_ESCAPE_CAPS_LOCK,
    EC_TOGG    = QK_MAGIC_TOGGLE_ESCAPE_CAPS_LOCK,
    MI_ON      = QK_MIDI_ON,
    MI_OFF     = QK_MIDI_OFF,
    MI_TOGG    = QK_MIDI_TOGGLE,
    MI_C       = QK_MIDI_NOTE_C_0,
    MI_Cs      = QK_MIDI_NOTE_C_SHARP_0,
    MI_Db      = QK_MIDI_NOTE_C_SHARP_0,
    MI_D       = QK_MIDI_NOTE_D_0,
    MI_Ds      = QK_MIDI_NOTE_D_SHARP_0,
    MI_Eb      = QK_MIDI_NOTE_D_SHARP_0,
    MI_E       = QK_MIDI_NOTE_E_0,
    MI_F       = QK_MIDI_NOTE_F_0,
    MI_Fs      = QK_MIDI_NOTE_F_SHARP_0,
    MI_Gb      = QK_MIDI_NOTE_F_SHARP_0,
    MI_G       = QK_MIDI_NOTE_G_0,
    MI_Gs      = QK_MIDI_NOTE_G_SHARP_0,
    MI_Ab      = QK_MIDI_NOTE_G_SHARP_0,
    MI_A       = QK_MIDI_NOTE_A_0,
    MI_As      = QK_MIDI_NOTE_A_SHARP_0,
    MI_Bb      = QK_MIDI_NOTE_A_SHARP_0,
    MI_B       = QK_MIDI_NOTE_B_0,
    MI_C1      = QK_MIDI_NOTE_C_1,
    MI_Cs1     = QK_MIDI_NOTE_C_SHARP_1,
    MI_Db1     = QK_MIDI_NOTE_C_SHARP_1,
    MI_D1      = QK_MIDI_NOTE_D_1,
    MI_Ds1     = QK_MIDI_NOTE_D_SHARP_1,
    MI_Eb1     = QK_MIDI_NOTE_D_SHARP_1,
    MI_E1      = QK_MIDI_NOTE_E_1,
    MI_F1      = QK_MIDI_NOTE_F_1,
    MI_Fs1     = QK_MIDI_NOTE_F_SHARP_1,
    MI_Gb1     = QK_MIDI_NOTE_F_SHARP_1,
    MI_G1      = QK_MIDI_NOTE_G_1,
    MI_Gs1     = QK_MIDI_NOTE_G_SHARP_1,
    MI_Ab1     = QK_MIDI_NOTE_G_SHARP_1,
    MI_A1      = QK_MIDI_NOTE_A_1,
    MI_As1     = QK_MIDI_NOTE_A_SHARP_1,
    MI_Bb1     = QK_MIDI_NOTE_A_SHARP_1,
    MI_B1      = QK_MIDI_NOTE_B_1,
    MI_C2      = QK_MIDI_NOTE_C_2,
    MI_Cs2     = QK_MIDI_NOTE_C_SHARP_2,
    MI_Db2     = QK_MIDI_NOTE_C_SHARP_2,
    MI_D2      = QK_MIDI_NOTE_D_2,
    MI_Ds2     = QK_MIDI_NOTE_D_SHARP_2,
    MI_Eb2     = QK_MIDI_NOTE_D_SHARP_2,
    MI_E2      = QK_MIDI_NOTE_E_2,
    MI_F2      = QK_MIDI_NOTE_F_2,
    MI_Fs2     = QK_MIDI_NOTE_F_SHARP_2,
    MI_Gb2     = QK_MIDI_NOTE_F_SHARP_2,
    MI_G2      = QK_MIDI_NOTE_G_2,
    MI_Gs2     = QK_MIDI_NOTE_G_SHARP_2,
    MI_Ab2     = QK_MIDI_NOTE_G_SHARP_2,
    MI_A2      = QK_MIDI_NOTE_A_2,
    MI_As2     = QK_MIDI_NOTE_A_SHARP_2,
    MI_Bb2     = QK_MIDI_NOTE_A_SHARP_2,
    MI_B2      = QK_MIDI_NOTE_B_2,
    MI_C3      = QK_MIDI_NOTE_C_3,
    MI_Cs3     = QK_MIDI_NOTE_C_SHARP_3,
    MI_Db3     = QK_MIDI_NOTE_C_SHARP_3,
    MI_D3      = QK_MIDI_NOTE_D_3,
    MI_Ds3     = QK_MIDI_NOTE_D_SHARP_3,
    MI_Eb3     = QK_MIDI_NOTE_D_SHARP_3,
    MI_E3      = QK_MIDI_NOTE_E_3,
    MI_F3      = QK_MIDI_NOTE_F_3,
    MI_Fs3     = QK_MIDI_NOTE_F_SHARP_3,
    MI_Gb3     = QK_MIDI_NOTE_F_SHARP_3,
    MI_G3      = QK_MIDI_NOTE_G_3,
    MI_Gs3     = QK_MIDI_NOTE_G_SHARP_3,
    MI_Ab3     = QK_MIDI_NOTE_G_SHARP_3,
    MI_A3      = QK_MIDI_NOTE_A_3,
    MI_As3     = QK_MIDI_NOTE_A_SHARP_3,
    MI_Bb3     = QK_MIDI_NOTE_A_SHARP_3,
    MI_B3      = QK_MIDI_NOTE_B_3,
    MI_C4      = QK_MIDI_NOTE_C_4,
    MI_Cs4     = QK_MIDI_NOTE_C_SHARP_4,
    MI_Db4     = QK_MIDI_NOTE_C_SHARP_4,
    MI_D4      = QK_MIDI_NOTE_D_4,
    MI_Ds4     = QK_MIDI_NOTE_D_SHARP_4,
    MI_Eb4     = QK_MIDI_NOTE_D_SHARP_4,
    MI_E4      = QK_MIDI_NOTE_E_4,
    MI_F4      = QK_MIDI_NOTE_F_4,
    MI_Fs4     = QK_MIDI_NOTE_F_SHARP_4,
    MI_Gb4     = QK_MIDI_NOTE_F_SHARP_4,
    MI_G4      = QK_MIDI_NOTE_G_4,
    MI_Gs4     = QK_MIDI_NOTE_G_SHARP_4,
    MI_Ab4     = QK_MIDI_NOTE_G_SHARP_4,
    MI_A4      = QK_MIDI_NOTE_A_4,
    MI_As4     = QK_MIDI_NOTE_A_SHARP_4,
    MI_Bb4     = QK_MIDI_NOTE_A_SHARP_4,
    MI_B4      = QK_MIDI_NOTE_B_4,
    MI_C5      = QK_MIDI_NOTE_C_5,
    MI_Cs5     = QK_MIDI_NOTE_C_SHARP_5,
    MI_Db5     = QK_MIDI_NOTE_C_SHARP_5,
    MI_D5      = QK_MIDI_NOTE_D_5,
    MI_Ds5     = QK_MIDI_NOTE_D_SHARP_5,
    MI_Eb5     = QK_MIDI_NOTE_D_SHARP_5,
    MI_E5      = QK_MIDI_NOTE_E_5,
    MI_F5      = QK_MIDI_NOTE_F_5,
    MI_Fs5     = QK_MIDI_NOTE_F_SHARP_5,
    MI_Gb5     = QK_MIDI_NOTE_F_SHARP_5,
    MI_G5      = QK_MIDI_NOTE_G_5,
    MI_Gs5     = QK_MIDI_NOTE_G_SHARP_5,
    MI_Ab5     = QK_MIDI_NOTE_G_SHARP_5,
    MI_A5      = QK_MIDI_NOTE_A_5,
    MI_As5     = QK_MIDI_NOTE_A_SHARP_5,
    MI_Bb5     = QK_MIDI_NOTE_A_SHARP_5,
    MI_B5      = QK_MIDI_NOTE_B_5,
    MI_OCN2    = QK_MIDI_OCTAVE_N2,
    MI_OCN1    = QK_MIDI_OCTAVE_N1,
    MI_OC0     = QK_MIDI_OCTAVE_0,
    MI_OC1     = QK_MIDI_OCTAVE_1,
    MI_OC2     = QK_MIDI_OCTAVE_2,
    MI_OC3     = QK_MIDI_OCTAVE_3,
    MI_OC4     = QK_MIDI_OCTAVE_4,
    MI_OC5     = QK_MIDI_OCTAVE_5,
    MI_OC6     = QK_MIDI_OCTAVE_6,
    MI_OC7     = QK_MIDI_OCTAVE_7,
    MI_OCTD    = QK_MIDI_OCTAVE_DOWN,
    MI_OCTU    = QK_MIDI_OCTAVE_UP,
    MI_TRN6    = QK_MIDI_TRANSPOSE_N6,
    MI_TRN5    = QK_MIDI_TRANSPOSE_N5,
    MI_TRN4    = QK_MIDI_TRANSPOSE_N4,
    MI_TRN3    = QK_MIDI_TRANSPOSE_N3,
    MI_TRN2    = QK_MIDI_TRANSPOSE_N2,
    MI_TRN1    = QK_MIDI_TRANSPOSE_N1,
    MI_TR0     = QK_MIDI_TRANSPOSE_0,
    MI_TR1     = QK_MIDI_TRANSPOSE_1,
    MI_TR2     = QK_MIDI_TRANSPOSE_2,
    MI_TR3     = QK_MIDI_TRANSPOSE_3,
    MI_TR4     = QK_MIDI_TRANSPOSE_4,
    MI_TR5     = QK_MIDI_TRANSPOSE_5,
    MI_TR6     = QK_MIDI_TRANSPOSE_6,
    MI_TRSD    = QK_MIDI_TRANSPOSE_DOWN,
    MI_TRSU    = QK_MIDI_TRANSPOSE_UP,
    MI_VL0     = QK_MIDI_VELOCITY_0,
    MI_VL1     = QK_MIDI_VELOCITY_1,
    MI_VL2     = QK_MIDI_VELOCITY_2,
    MI_VL3     = QK_MIDI_VELOCITY_3,
    MI_VL4     = QK_MIDI_VELOCITY_4,
    MI_VL5     = QK_MIDI_VELOCITY_5,
    MI_VL6     = QK_MIDI_VELOCITY_6,
    MI_VL7     = QK_MIDI_VELOCITY_7,
    MI_VL8     = QK_MIDI_VELOCITY_8,
    MI_VL9     = QK_MIDI_VELOCITY_9,
    MI_VL10    = QK_MIDI_VELOCITY_10,
    MI_VELD    = QK_MIDI_VELOCITY_DOWN,
    MI_VELU    = QK_MIDI_VELOCITY_UP,
    MI_CH1     = QK_MIDI_CHANNEL_1,
    MI_CH2     = QK_MIDI_CHANNEL_2,
    MI_CH3     = QK_MIDI_CHANNEL_3,
    MI_CH4     = QK_MIDI_CHANNEL_4,
    MI_CH5     = QK_MIDI_CHANNEL_5,
    MI_CH6     = QK_MIDI_CHANNEL_6,
    MI_CH7     = QK_MIDI_CHANNEL_7,
    MI_CH8     = QK_MIDI_CHANNEL_8,
    MI_CH9     = QK_MIDI_CHANNEL_9,
    MI_CH10    = QK_MIDI_CHANNEL_10,
    MI_CH11    = QK_MIDI_CHANNEL_11,
    MI_CH12    = QK_MIDI_CHANNEL_12,
    MI_CH13    = QK_MIDI_CHANNEL_13,
    MI_CH14    = QK_MIDI_CHANNEL_14,
    MI_CH15    = QK_MIDI_CHANNEL_15,
    MI_CH16    = QK_MIDI_CHANNEL_16,
    MI_CHND    = QK_MIDI_CHANNEL_DOWN,
    MI_CHNU    = QK_MIDI_CHANNEL_UP,
    MI_AOFF    = QK_MIDI_ALL_NOTES_OFF,
    MI_SUST    = QK_MIDI_SUSTAIN,
    MI_PORT    = QK_MIDI_PORTAMENTO,
    MI_SOST    = QK_MIDI_SOSTENUTO,
    MI_SOFT    = QK_MIDI_SOFT,
    MI_LEG     = QK_MIDI_LEGATO,
    MI_MOD     = QK_MIDI_MODULATION,
    MI_MODD    = QK_MIDI_MODULATION_SPEED_DOWN,
    MI_MODU    = QK_MIDI_MODULATION_SPEED_UP,
    MI_BNDD    = QK_MIDI_PITCH_BEND_DOWN,
    MI_BNDU    = QK_MIDI_PITCH_BEND_UP,
    SQ_ON      = QK_SEQUENCER_ON,
    SQ_OFF     = QK_SEQUENCER_OFF,
    SQ_TOGG    = QK_SEQUENCER_TOGGLE,
    SQ_TMPD    = QK_SEQUENCER_TEMPO_DOWN,
    SQ_TMPU    = QK_SEQUENCER_TEMPO_UP,
    SQ_RESD    = QK_SEQUENCER_RESOLUTION_DOWN,
    SQ_RESU    = QK_SEQUENCER_RESOLUTION_UP,
    SQ_SALL    = QK_SEQUENCER_STEPS_ALL,
    SQ_SCLR    = QK_SEQUENCER_STEPS_CLEAR,
    JS_0       = QK_JOYSTICK_BUTTON_0,
    JS_1       = QK_JOYSTICK_BUTTON_1,
    JS_2       = QK_JOYSTICK_BUTTON_2,
    JS_3       = QK_JOYSTICK_BUTTON_3,
    JS_4       = QK_JOYSTICK_BUTTON_4,
    JS_5       = QK_JOYSTICK_BUTTON_5,
    JS_6       = QK_JOYSTICK_BUTTON_6,
    JS_7       = QK_JOYSTICK_BUTTON_7,
    JS_8       = QK_JOYSTICK_BUTTON_8,
    JS_9       = QK_JOYSTICK_BUTTON_9,
    JS_10      = QK_JOYSTICK_BUTTON_10,
    JS_11      = QK_JOYSTICK_BUTTON_11,
    JS_12      = QK_JOYSTICK_BUTTON_12,
    JS_13      = QK_JOYSTICK_BUTTON_13,
    JS_14      = QK_JOYSTICK_BUTTON_14,
    JS_15      = QK_JOYSTICK_BUTTON_15,
    JS_16      = QK_JOYSTICK_BUTTON_16,
    JS_17      = QK_JOYSTICK_BUTTON_17,
    JS_18      = QK_JOYSTICK_BUTTON_18,
    JS_19      = QK_JOYSTICK_BUTTON_19,
    JS_20      = QK_JOYSTICK_BUTTON_20,
    JS_21      = QK_JOYSTICK_BUTTON_21,
    JS_22      = QK_JOYSTICK_BUTTON_22,
    JS_23      = QK_JOYSTICK_BUTTON_23,
    JS_24      = QK_JOYSTICK_BUTTON_24,
    JS_25      = QK_JOYSTICK_BUTTON_25,
    JS_26      = QK_JOYSTICK_BUTTON_26,
    JS_27      = QK_JOYSTICK_BUTTON_27,
    JS_28      = QK_JOYSTICK_BUTTON_28,
    JS_29      = QK_JOYSTICK_BUTTON_29,
    JS_30      = QK_JOYSTICK_BUTTON_30,
    JS_31      = QK_JOYSTICK_BUTTON_31,
    PB_1       = QK_PROGRAMMABLE_BUTTON_1,
    PB_2       = QK_PROGRAMMABLE_BUTTON_2,
    PB_3       = QK_PROGRAMMABLE_BUTTON_3,
    PB_4       = QK_PROGRAMMABLE_BUTTON_4,
    PB_5       = QK_PROGRAMMABLE_BUTTON_5,
    PB_6       = QK_PROGRAMMABLE_BUTTON_6,
    PB_7       = QK_PROGRAMMABLE_BUTTON_7,
    PB_8       = QK_PROGRAMMABLE_BUTTON_8,
    PB_9       = QK_PROGRAMMABLE_BUTTON_9,
    PB_10      = QK_PROGRAMMABLE_BUTTON_10,
    PB_11      = QK_PROGRAMMABLE_BUTTON_11,
    PB_12      = QK_PROGRAMMABLE_BUTTON_12,
    PB_13      = QK_PROGRAMMABLE_BUTTON_13,
    PB_14      = QK_PROGRAMMABLE_BUTTON_14,
    PB_15      = QK_PROGRAMMABLE_BUTTON_15,
    PB_16      = QK_PROGRAMMABLE_BUTTON_16,
    PB_17      = QK_PROGRAMMABLE_BUTTON_17,
    PB_18      = QK_PROGRAMMABLE_BUTTON_18,
    PB_19      = QK_PROGRAMMABLE_BUTTON_19,
    PB_20      = QK_PROGRAMMABLE_BUTTON_20,
    PB_21      = QK_PROGRAMMABLE_BUTTON_21,
    PB_22      = QK_PROGRAMMABLE_BUTTON_22,
    PB_23      = QK_PROGRAMMABLE_BUTTON_23,
    PB_24      = QK_PROGRAMMABLE_BUTTON_24,
    PB_25      = QK_PROGRAMMABLE_BUTTON_25,
    PB_26      = QK_PROGRAMMABLE_BUTTON_26,
    PB_27      = QK_PROGRAMMABLE_BUTTON_27,
    PB_28      = QK_PROGRAMMABLE_BUTTON_28,
    PB_29      = QK_PROGRAMMABLE_BUTTON_29,
    PB_30      = QK_PROGRAMMABLE_BUTTON_30,
    PB_31      = QK_PROGRAMMABLE_BUTTON_31,
    PB_32      = QK_PROGRAMMABLE_BUTTON_32,
    AU_ON      = QK_AUDIO_ON,
    AU_OFF     = QK_AUDIO_OFF,
    AU_TOGG    = QK_AUDIO_TOGGLE,
    CK_TOGG    = QK_AUDIO_CLICKY_TOGGLE,
    CK_ON      = QK_AUDIO_CLICKY_ON,
    CK_OFF     = QK_AUDIO_CLICKY_OFF,
    CK_UP      = QK_AUDIO_CLICKY_UP,
    CK_DOWN    = QK_AUDIO_CLICKY_DOWN,
    CK_RST     = QK_AUDIO_CLICKY_RESET,
    MU_ON      = QK_MUSIC_ON,
    MU_OFF     = QK_MUSIC_OFF,
    MU_TOGG    = QK_MUSIC_TOGGLE,
    MU_NEXT    = QK_MUSIC_MODE_NEXT,
    AU_NEXT    = QK_AUDIO_VOICE_NEXT,
    AU_PREV    = QK_AUDIO_VOICE_PREVIOUS,
    MC_0       = QK_MACRO_0,
    MC_1       = QK_MACRO_1,
    MC_2       = QK_MACRO_2,
    MC_3       = QK_MACRO_3,
    MC_4       = QK_MACRO_4,
    MC_5       = QK_MACRO_5,
    MC_6       = QK_MACRO_6,
    MC_7       = QK_MACRO_7,
    MC_8       = QK_MACRO_8,
    MC_9       = QK_MACRO_9,
    MC_10      = QK_MACRO_10,
    MC_11      = QK_MACRO_11,
    MC_12      = QK_MACRO_12,
    MC_13      = QK_MACRO_13,
    MC_14      = QK_MACRO_14,
    MC_15      = QK_MACRO_15,
    MC_16      = QK_MACRO_16,
    MC_17      = QK_MACRO_17,
    MC_18      = QK_MACRO_18,
    MC_19      = QK_MACRO_19,
    MC_20      = QK_MACRO_20,
    MC_21      = QK_MACRO_21,
    MC_22      = QK_MACRO_22,
    MC_23      = QK_MACRO_23,
    MC_24      = QK_MACRO_24,
    MC_25      = QK_MACRO_25,
    MC_26      = QK_MACRO_26,
    MC_27      = QK_MACRO_27,
    MC_28      = QK_MACRO_28,
    MC_29      = QK_MACRO_29,
    MC_30      = QK_MACRO_30,
    MC_31      = QK_MACRO_31,
    OU_AUTO    = QK_OUTPUT_AUTO,
    OU_NEXT    = QK_OUTPUT_NEXT,
    OU_PREV    = QK_OUTPUT_PREV,
    OU_NONE    = QK_OUTPUT_NONE,
    OU_USB     = QK_OUTPUT_USB,
    OU_2P4G    = QK_OUTPUT_2P4GHZ,
    OU_BT      = QK_OUTPUT_BLUETOOTH,
    BT_NEXT    = QK_BLUETOOTH_PROFILE_NEXT,
    BT_PREV    = QK_BLUETOOTH_PROFILE_PREV,
    BT_UNPR    = QK_BLUETOOTH_UNPAIR,
    BT_PRF1    = QK_BLUETOOTH_PROFILE1,
    BT_PRF2    = QK_BLUETOOTH_PROFILE2,
    BT_PRF3    = QK_BLUETOOTH_PROFILE3,
    BT_PRF4    = QK_BLUETOOTH_PROFILE4,
    BT_PRF5    = QK_BLUETOOTH_PROFILE5,
    BL_ON      = QK_BACKLIGHT_ON,
    BL_OFF     = QK_BACKLIGHT_OFF,
    BL_TOGG    = QK_BACKLIGHT_TOGGLE,
    BL_DOWN    = QK_BACKLIGHT_DOWN,
    BL_UP      = QK_BACKLIGHT_UP,
    BL_STEP    = QK_BACKLIGHT_STEP,
    BL_BRTG    = QK_BACKLIGHT_TOGGLE_BREATHING,
    LM_ON      = QK_LED_MATRIX_ON,
    LM_OFF     = QK_LED_MATRIX_OFF,
    LM_TOGG    = QK_LED_MATRIX_TOGGLE,
    LM_NEXT    = QK_LED_MATRIX_MODE_NEXT,
    LM_PREV    = QK_LED_MATRIX_MODE_PREVIOUS,
    LM_BRIU    = QK_LED_MATRIX_BRIGHTNESS_UP,
    LM_BRID    = QK_LED_MATRIX_BRIGHTNESS_DOWN,
    LM_SPDU    = QK_LED_MATRIX_SPEED_UP,
    LM_SPDD    = QK_LED_MATRIX_SPEED_DOWN,
    UG_TOGG    = QK_UNDERGLOW_TOGGLE,
    UG_NEXT    = QK_UNDERGLOW_MODE_NEXT,
    UG_PREV    = QK_UNDERGLOW_MODE_PREVIOUS,
    UG_HUEU    = QK_UNDERGLOW_HUE_UP,
    UG_HUED    = QK_UNDERGLOW_HUE_DOWN,
    UG_SATU    = QK_UNDERGLOW_SATURATION_UP,
    UG_SATD    = QK_UNDERGLOW_SATURATION_DOWN,
    UG_VALU    = QK_UNDERGLOW_VALUE_UP,
    UG_VALD    = QK_UNDERGLOW_VALUE_DOWN,
    UG_SPDU    = QK_UNDERGLOW_SPEED_UP,
    UG_SPDD    = QK_UNDERGLOW_SPEED_DOWN,
    RGB_M_P    = RGB_MODE_PLAIN,
    RGB_M_B    = RGB_MODE_BREATHE,
    RGB_M_R    = RGB_MODE_RAINBOW,
    RGB_M_SW   = RGB_MODE_SWIRL,
    RGB_M_SN   = RGB_MODE_SNAKE,
    RGB_M_K    = RGB_MODE_KNIGHT,
    RGB_M_X    = RGB_MODE_XMAS,
    RGB_M_G    = RGB_MODE_GRADIENT,
    RGB_M_T    = RGB_MODE_RGBTEST,
    RGB_M_TW   = RGB_MODE_TWINKLE,
    RM_ON      = QK_RGB_MATRIX_ON,
    RM_OFF     = QK_RGB_MATRIX_OFF,
    RM_TOGG    = QK_RGB_MATRIX_TOGGLE,
    RM_NEXT    = QK_RGB_MATRIX_MODE_NEXT,
    RM_PREV    = QK_RGB_MATRIX_MODE_PREVIOUS,
    RM_HUEU    = QK_RGB_MATRIX_HUE_UP,
    RM_HUED    = QK_RGB_MATRIX_HUE_DOWN,
    RM_SATU    = QK_RGB_MATRIX_SATURATION_UP,
    RM_SATD    = QK_RGB_MATRIX_SATURATION_DOWN,
    RM_VALU    = QK_RGB_MATRIX_VALUE_UP,
    RM_VALD    = QK_RGB_MATRIX_VALUE_DOWN,
    RM_SPDU    = QK_RGB_MATRIX_SPEED_UP,
    RM_SPDD    = QK_RGB_MATRIX_SPEED_DOWN,
    QK_BOOT    = QK_BOOTLOADER,
    QK_RBT     = QK_REBOOT,
    DB_TOGG    = QK_DEBUG_TOGGLE,
    EE_CLR     = QK_CLEAR_EEPROM,
    AS_DOWN    = QK_AUTO_SHIFT_DOWN,
    AS_UP      = QK_AUTO_SHIFT_UP,
    AS_RPT     = QK_AUTO_SHIFT_REPORT,
    AS_ON      = QK_AUTO_SHIFT_ON,
    AS_OFF     = QK_AUTO_SHIFT_OFF,
    AS_TOGG    = QK_AUTO_SHIFT_TOGGLE,
    QK_GESC    = QK_GRAVE_ESCAPE,
    VK_TOGG    = QK_VELOCIKEY_TOGGLE,
    SC_LCPO    = QK_SPACE_CADET_LEFT_CTRL_PARENTHESIS_OPEN,
    SC_RCPC    = QK_SPACE_CADET_RIGHT_CTRL_PARENTHESIS_CLOSE,
    SC_LSPO    = QK_SPACE_CADET_LEFT_SHIFT_PARENTHESIS_OPEN,
    SC_RSPC    = QK_SPACE_CADET_RIGHT_SHIFT_PARENTHESIS_CLOSE,
    SC_LAPO    = QK_SPACE_CADET_LEFT_ALT_PARENTHESIS_OPEN,
    SC_RAPC    = QK_SPACE_CADET_RIGHT_ALT_PARENTHESIS_CLOSE,
    SC_SENT    = QK_SPACE_CADET_RIGHT_SHIFT_ENTER,
    UC_NEXT    = QK_UNICODE_MODE_NEXT,
    UC_PREV    = QK_UNICODE_MODE_PREVIOUS,
    UC_MAC     = QK_UNICODE_MODE_MACOS,
    UC_LINX    = QK_UNICODE_MODE_LINUX,
    UC_WIN     = QK_UNICODE_MODE_WINDOWS,
    UC_BSD     = QK_UNICODE_MODE_BSD,
    UC_WINC    = QK_UNICODE_MODE_WINCOMPOSE,
    UC_EMAC    = QK_UNICODE_MODE_EMACS,
    HF_ON      = QK_HAPTIC_ON,
    HF_OFF     = QK_HAPTIC_OFF,
    HF_TOGG    = QK_HAPTIC_TOGGLE,
    HF_RST     = QK_HAPTIC_RESET,
    HF_FDBK    = QK_HAPTIC_FEEDBACK_TOGGLE,
    HF_BUZZ    = QK_HAPTIC_BUZZ_TOGGLE,
    HF_NEXT    = QK_HAPTIC_MODE_NEXT,
    HF_PREV    = QK_HAPTIC_MODE_PREVIOUS,
    HF_CONT    = QK_HAPTIC_CONTINUOUS_TOGGLE,
    HF_CONU    = QK_HAPTIC_CONTINUOUS_UP,
    HF_COND    = QK_HAPTIC_CONTINUOUS_DOWN,
    HF_DWLU    = QK_HAPTIC_DWELL_UP,
    HF_DWLD    = QK_HAPTIC_DWELL_DOWN,
    CM_ON      = QK_COMBO_ON,
    CM_OFF     = QK_COMBO_OFF,
    CM_TOGG    = QK_COMBO_TOGGLE,
    DM_REC1    = QK_DYNAMIC_MACRO_RECORD_START_1,
    DM_REC2    = QK_DYNAMIC_MACRO_RECORD_START_2,
    DM_RSTP    = QK_DYNAMIC_MACRO_RECORD_STOP,
    DM_PLY1    = QK_DYNAMIC_MACRO_PLAY_1,
    DM_PLY2    = QK_DYNAMIC_MACRO_PLAY_2,
    QK_LEAD    = QK_LEADER,
    OS_ON      = QK_ONE_SHOT_ON,
    OS_OFF     = QK_ONE_SHOT_OFF,
    OS_TOGG    = QK_ONE_SHOT_TOGGLE,
    KO_TOGG    = QK_KEY_OVERRIDE_TOGGLE,
    KO_ON      = QK_KEY_OVERRIDE_ON,
    KO_OFF     = QK_KEY_OVERRIDE_OFF,
    SE_LOCK    = QK_SECURE_LOCK,
    SE_UNLK    = QK_SECURE_UNLOCK,
    SE_TOGG    = QK_SECURE_TOGGLE,
    SE_REQ     = QK_SECURE_REQUEST,
    DT_PRNT    = QK_DYNAMIC_TAPPING_TERM_PRINT,
    DT_UP      = QK_DYNAMIC_TAPPING_TERM_UP,
    DT_DOWN    = QK_DYNAMIC_TAPPING_TERM_DOWN,
    CW_TOGG    = QK_CAPS_WORD_TOGGLE,
    AC_ON      = QK_AUTOCORRECT_ON,
    AC_OFF     = QK_AUTOCORRECT_OFF,
    AC_TOGG    = QK_AUTOCORRECT_TOGGLE,
    TL_LOWR    = QK_TRI_LAYER_LOWER,
    TL_UPPR    = QK_TRI_LAYER_UPPER,
    QK_REP     = QK_REPEAT_KEY,
    QK_AREP    = QK_ALT_REPEAT_KEY,
    QK_LLCK    = QK_LAYER_LOCK,
};
// Custom Keycode
#define KC_MOD_MIN KC_LCTL
#define KC_MOD_MAX KC_RGUI
#define IS_MOD(keycode) ((keycode>=KC_MOD_MIN)&&(keycode<=KC_MOD_MAX))
#define MOD_TO_BIT(keycode) (1 << (keycode-KC_MOD_MIN))

