leeseunghun057/STM32with8000Hz/STM32H743/Core/Inc/main.h
#define BIT_LCTL 0b00000001
#define BIT_LSFT 0b00000010
#define BIT_LALT 0b00000100
#define BIT_LGUI 0b00001000
#define BIT_RCTL 0b00010000
#define BIT_RSFT 0b00100000
#define BIT_RALT 0b01000000
#define BIT_RGUI 0b10000000

#define C(keycode) (((uint16_t)BIT_LCTL<<8)|(uint16_t)keycode)
#define S(keycode) (((uint16_t)BIT_LSFT<<8)|(uint16_t)keycode)
#define A(keycode) (((uint16_t)BIT_LALT<<8)|(uint16_t)keycode)
#define G(keycode) (((uint16_t)BIT_LGUI<<8)|(uint16_t)keycode)

#define KC_MODIED_MIN C(0)
#define KC_MODIED_MAX A(S(C(G(0xFF))))

#define IS_CTLED(keycode) ((KC_MODIED_MIN<=keycode && KC_MODIED_MAX>=keycode)&&(keycode>>8&BIT_LCTL))
#define IS_SFTED(keycode) ((KC_MODIED_MIN<=keycode && KC_MODIED_MAX>=keycode)&&(keycode>>8&BIT_LSFT))
#define IS_ALTED(keycode) ((KC_MODIED_MIN<=keycode && KC_MODIED_MAX>=keycode)&&(keycode>>8&BIT_LALT))
#define IS_GUIED(keycode) ((KC_MODIED_MIN<=keycode && KC_MODIED_MAX>=keycode)&&(keycode>>8&BIT_LGUI))
#define IS_MODIED(keycode) ((KC_MODIED_MIN<=keycode && KC_MODIED_MAX>=keycode)&&(keycode>>8))

#define KC_FN_MIN 0x5000 // turn on layer when held
#define KC_FN_MAX 0x50FF
#define KC_TD_MIN 0x5100 // tap dance
#define KC_TD_MAX 0x51FF
#define KC_DF_MIN 0x5200
#define KC_DF_MAX 0x52FF
#define FN(layernumber) (KC_FN_MIN+layernumber)
#define FN_TO_LAYER_NUMBER(fnx) (fnx-KC_FN_MIN)
#define IS_FN(keycode) ((keycode>=KC_FN_MIN)&&(keycode<=KC_FN_MAX))
#define TD(index) (KC_TD_MIN+index)
#define TD_TO_INDEX(tdx) (tdx-KC_TD_MIN)
#define IS_TD(keycode) ((keycode>=KC_TD_MIN)&&(keycode<=KC_TD_MAX))
#define DF(index) (KC_DF_MIN+index)
#define DF_TO_INDEX(dfx) (dfx-KC_DF_MIN)
#define IS_DF(keycode) ((keycode>=KC_DF_MIN)&&(keycode<=KC_DF_MAX))

#define KC_TILD S(KC_GRAVE) // ~
#define KC_EXLM S(KC_1)    // !
#define KC_AT   S(KC_2)    // @
#define KC_HASH S(KC_3)    // #
#define KC_DLR  S(KC_4)    // $
#define KC_PERC S(KC_5)    // %
#define KC_CIRC S(KC_6)    // ^
#define KC_AMPR S(KC_7)    // &
#define KC_ASTR S(KC_8)    // *
#define KC_LPRN S(KC_9)    // (
#define KC_RPRN S(KC_0)    // )
#define KC_UNDS S(KC_MINUS) // _
#define KC_PLUS S(KC_EQUAL) // +
#define KC_LCBR S(KC_LEFT_BRACKET) // {
#define KC_RCBR S(KC_RIGHT_BRACKET) // }
#define KC_PIPE S(KC_BACKSLASH) // |
#define KC_COLN S(KC_SEMICOLON) // :
#define KC_DQUO S(KC_QUOTE) // "
#define KC_LABK S(KC_COMMA) // <
#define KC_RABK S(KC_DOT)  // >
#define KC_QUES S(KC_SLASH) // ?

#define KC_TILDE KC_TILD
#define KC_EXCLAIM KC_EXLM
#define KC_DOLLAR KC_DLR
#define KC_PERCENT KC_PERC
#define KC_CIRCUMFLEX KC_CIRC
#define KC_AMPERSAND KC_AMPR
#define KC_ASTERISK KC_ASTR
#define KC_LEFT_PAREN KC_LPRN
#define KC_RIGHT_PAREN KC_RPRN
#define KC_UNDERSCORE KC_UNDS
#define KC_LEFT_CURLY_BRACE KC_LCBR
#define KC_RIGHT_CURLY_BRACE KC_RCBR
#define KC_COLON KC_COLN
#define KC_DOUBLE_QUOTE KC_DQUO
#define KC_DQT KC_DQUO
#define KC_LEFT_ANGLE_BRACKET KC_LABK
#define KC_LT KC_LABK
#define KC_RIGHT_ANGLE_BRACKET KC_RABK
#define KC_GT KC_RABK
#define KC_QUESTION KC_QUES


#define GPIOA0_0   KC_N
#define GPIOA1_0   KC_M
#define GPIOA2_0   KC_COMM
#define GPIOA3_0   KC_DOT
#define GPIOA4_0   KC_SLSH
#define GPIOA5_0   KC_H
#define GPIOA6_0   KC_J
#define GPIOA7_0   KC_K
#define GPIOA8_0   0
#define GPIOA9_0   0
#define GPIOA10_0  0
#define GPIOA11_0  0
#define GPIOA12_0  0
#define GPIOA13_0  KC_T
#define GPIOA14_0  KC_R
#define GPIOA15_0  KC_E

#define GPIOB0_0   KC_L
#define GPIOB1_0   KC_SCLN
#define GPIOB2_0   KC_P
#define GPIOB3_0   KC_W
#define GPIOB4_0   KC_Q
#define GPIOB5_0   KC_A
#define GPIOB6_0   KC_S
#define GPIOB7_0   KC_G
#define GPIOB8_0   KC_F
#define GPIOB9_0   KC_D
#define GPIOB10_0  KC_O
#define GPIOB11_0  KC_I
#define GPIOB12_0  KC_U
#define GPIOB13_0  KC_Y
#define GPIOB14_0  0
#define GPIOB15_0  0

#define GPIOC0_0   0
#define GPIOC1_0   0
#define GPIOC2_0   0
#define GPIOC3_0   0
#define GPIOC4_0   0
#define GPIOC5_0   0
#define GPIOC6_0   0
#define GPIOC7_0   0
#define GPIOC8_0   0
#define GPIOC9_0   0
#define GPIOC10_0  0
#define GPIOC11_0  0
#define GPIOC12_0  0
#define GPIOC13_0  KC_Z
#define GPIOC14_0  KC_X
#define GPIOC15_0  KC_C

#define GPIOD0_0   0
#define GPIOD1_0   0
#define GPIOD2_0   0
#define GPIOD3_0   0
#define GPIOD4_0   0
#define GPIOD5_0   0
#define GPIOD6_0   0
#define GPIOD7_0   0
#define GPIOD8_0   0
#define GPIOD9_0   0
#define GPIOD10_0  0
#define GPIOD11_0  0
#define GPIOD12_0  0
#define GPIOD13_0  0
#define GPIOD14_0  0
#define GPIOD15_0  0

#define GPIOE0_0   0
#define GPIOE1_0   0
#define GPIOE2_0   0
#define GPIOE3_0   0
#define GPIOE4_0   0
#define GPIOE5_0   0
#define GPIOE6_0   0
#define GPIOE7_0   0
#define GPIOE8_0   0
#define GPIOE9_0   0
#define GPIOE10_0  0
#define GPIOE11_0  0
#define GPIOE12_0  0
#define GPIOE13_0  0
#define GPIOE14_0  0
#define GPIOE15_0  0

#define GPIOF0_0   KC_V
#define GPIOF1_0   KC_B
#define GPIOF2_0   0
#define GPIOF3_0   0
#define GPIOF4_0   0
#define GPIOF5_0   0
#define GPIOF6_0   0
#define GPIOF7_0   0
#define GPIOF8_0   0
#define GPIOF9_0   0
#define GPIOF10_0  0
#define GPIOF11_0  0
#define GPIOF12_0  0
#define GPIOF13_0  0
#define GPIOF14_0  0
#define GPIOF15_0  0



#define GPIOA0_1   KC_N
#define GPIOA1_1   KC_M
#define GPIOA2_1   KC_COMM
#define GPIOA3_1   KC_DOT
#define GPIOA4_1   KC_SLSH
#define GPIOA5_1   KC_H
#define GPIOA6_1   KC_J
#define GPIOA7_1   KC_K
#define GPIOA8_1   0
#define GPIOA9_1   0
#define GPIOA10_1  0
#define GPIOA11_1  0
#define GPIOA12_1  0
#define GPIOA13_1  KC_T
#define GPIOA14_1  KC_R
#define GPIOA15_1  KC_E

#define GPIOB0_1   KC_L
#define GPIOB1_1   KC_SCLN
#define GPIOB2_1   KC_P
#define GPIOB3_1   KC_W
#define GPIOB4_1   KC_Q
#define GPIOB5_1   KC_A
#define GPIOB6_1   KC_S
#define GPIOB7_1   KC_G
#define GPIOB8_1   KC_F
#define GPIOB9_1   KC_D
#define GPIOB10_1  KC_O
#define GPIOB11_1  KC_I
#define GPIOB12_1  KC_U
#define GPIOB13_1  KC_Y
#define GPIOB14_1  0
#define GPIOB15_1  0

#define GPIOC0_1   0
#define GPIOC1_1   0
#define GPIOC2_1   0
#define GPIOC3_1   0
#define GPIOC4_1   0
#define GPIOC5_1   0
#define GPIOC6_1   0
#define GPIOC7_1   0
#define GPIOC8_1   0
#define GPIOC9_1   0
#define GPIOC10_1  0
#define GPIOC11_1  0
#define GPIOC12_1  0
#define GPIOC13_1  KC_Z
#define GPIOC14_1  KC_X
#define GPIOC15_1  KC_C

#define GPIOD0_1   0
#define GPIOD1_1   0
#define GPIOD2_1   0
#define GPIOD3_1   0
#define GPIOD4_1   0
#define GPIOD5_1   0
#define GPIOD6_1   0
#define GPIOD7_1   0
#define GPIOD8_1   0
#define GPIOD9_1   0
#define GPIOD10_1  0
#define GPIOD11_1  0
#define GPIOD12_1  0
#define GPIOD13_1  0
#define GPIOD14_1  0
#define GPIOD15_1  0

#define GPIOE0_1   0
#define GPIOE1_1   0
#define GPIOE2_1   0
#define GPIOE3_1   0
#define GPIOE4_1   0
#define GPIOE5_1   0
#define GPIOE6_1   0
#define GPIOE7_1   0
#define GPIOE8_1   0
#define GPIOE9_1   0
#define GPIOE10_1  0
#define GPIOE11_1  0
#define GPIOE12_1  0
#define GPIOE13_1  0
#define GPIOE14_1  0
#define GPIOE15_1  0

#define GPIOF0_1   KC_V
#define GPIOF1_1   KC_B
#define GPIOF2_1   0
#define GPIOF3_1   0
#define GPIOF4_1   0
#define GPIOF5_1   0
#define GPIOF6_1   0
#define GPIOF7_1   0
#define GPIOF8_1   0
#define GPIOF9_1   0
#define GPIOF10_1  0
#define GPIOF11_1  0
#define GPIOF12_1  0
#define GPIOF13_1  0
#define GPIOF14_1  0
#define GPIOF15_1  0

#define PIN(abc, num) abc*16+num
#define GPIO_A 0
#define GPIO_B 1
#define GPIO_C 2
#define GPIO_D 3
#define GPIO_E 4
#define GPIO_F 5

#define GPIO_0 0
#define GPIO_1 1
#define GPIO_2 2
#define GPIO_3 3
#define GPIO_4 4
#define GPIO_5 5
#define GPIO_6 6
#define GPIO_7 7
#define GPIO_8 8
#define GPIO_9 9
#define GPIO_10 10
#define GPIO_11 11
#define GPIO_12 12
#define GPIO_13 13
#define GPIO_14 14
#define GPIO_15 15
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
